Tekla.Structures.Drawing.HatchLine.HatchLineAttributes
The HatchLineAttributes class is the attributes class of the hatch line.

Tekla.Structures.Drawing.HatchLine.HatchLineAttributes.Width
Gets or sets the width of the hatch line.

Tekla.Structures.Drawing.HatchLine.HatchLineAttributes.Scale
Gets or sets the scale factor for the hatch line.

Tekla.Structures.Drawing.HatchLine.HatchLineAttributes.Alignment
Gets or sets the alignment of the hatch line.

Tekla.Structures.Drawing.HatchLine.HatchLineAttributes.ShowOuterLines
Gets or sets a value indicating whether to show outer lines of the hatch line.

Tekla.Structures.Drawing.HatchLine.HatchLineAttributes.ShowJointLines
Gets or sets a value indicating whether to show joint lines of the hatch line.

Tekla.Structures.Drawing.HatchLine.HatchLineAttributes.#ctor(System.Boolean)
Creates a new default attributes instance that doesn't load attributes.

Tekla.Structures.Drawing.HatchLine.HatchLineAttributes.#ctor
Creates a new default hatch line attributes instance that loads standard attributes.

Tekla.Structures.Drawing.HatchLine.HatchLineAttributes.#ctor(System.String)
Creates a new hatch line attributes instance that loads the specified attributes.
AttributesFile: The filename of the attributes file.

Tekla.Structures.Drawing.HatchLine.HatchLineAttributes.LoadAttributes(System.String)
Loads the attributes from the attribute file.
AttributeFile: The filename of the attribute file.
Returns: True if the attributes are loaded correctly. False if the attribute file loading failed.

Tekla.Structures.Drawing.HatchLine.HatchLineAttributes.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.